app/controllers/movies_controller.rb

      session[:ratings] = @ratings
    else
      #If ratings are empty make an empty hash
      @ratings = Hash[Movie.all_ratings.collect {|r| [r, r] }]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R', 'PG-13', 'PG', 'G') ORDER BY release_date